//
//  BlackBoardTextData.swift
//  IntoHistory
//
//  Created by LeeJiSoo on 2022/08/17.
//

let historyInfoArray = ["4ㆍ19혁명은 1960년 3월 부정선거로 일어난 사건이에요. 꼭 기억해주세요!",
                        "인천 상륙작전은 맥아더 장군이 북한의 남침 이후 인천지역에 대한 작전을 통해 북한군의 병참선과 배후를 공격하여 전쟁을 반전시킨 상륙작전입니다.",
                        "‘의사’는 무력으로 항거하여 의롭게 돌아가신 사람이고 ‘열사’는 맨몸으로 저항하여 자신의 지조를 나타낸 사람입니다.",
                        "“평양 탈환 작전”은 국군 제1사단 및 제7사단과 미군 제1기병사단이 북한군 평양방어사령부를 격파하고 10월 19일 북한의 수도를 탈환한 작전",
                        "“대한해협 해전”은 대한민국 해군 백두산 함이 1950년 6월 26일 북한의 무장병력을 태운 함선을 부산 앞바다에서 격퇴시킨 전투입니다.",
                        "“서울 수복작전”은 1950년 9월 15일 실시된 인천 상륙 작전의 성공 이후 9월 28일까지 서울 수복을 위해 치러진 전투입니다.",
                        "윤봉길의사는 25세라는 젊은 나이에 폭탄을 들고 망설임 없이 일본군에게 폭탄을 투하했지만 불발되었고, 곧바로 헌병에게 잡혀가 고문을 받았습니다.",
                        "안중근의사는 이토히로부미를 저격하고, 태극기를 위로 올리며 '코레아 우라! Коrea ura'라고 3번 외쳤습니다. 대한독립만세!",
                        "“서울 수복작전”은 1950년 9월 15일 실시된 인천 상륙 작전의 성공 이후 9월 28일까지 서울 수복을 위해 치러진 전투입니다.",
                        "“행주도하 작전”은 1950년 6월 28일부터 6월 29일까지 국군 제 1사단이 한강을 건너 퇴각한 작전입니다.",
                        "“6ㆍ25전쟁”은 1950년 6월 25일 새벽 4시경 북한군이 선전포고없이 기습 남침하여 발발한 전쟁입니다.",
                        "유관순 열사는 일제 강점기에 3ㆍ1운동으로 시작된 만세 운동을 하다 일본 형사들에게 잡혀 서대문형무소에서 고문으로 인해 순국했습니다.",
                        "백범김구선생님은 '내 소원은 우리나라 대한의 완전한 자주 독립이오'라고 말씀하시며 독립운동을 위한 다양한 애국계몽활동을 펼치셨습니다.",
                        "도산 안창호 선생은 1905년 을사조약으로 대한제국의 외교권을 일본 제국이 빼앗자, 대한 사람은 실력을 길러야한다는 애국계몽운동을 펼치셨습니다.",
                        "김좌진 장군은 신흥무관학교와 함께 민족정신에 충실한 젊은이들을 모아 독립군을 구성하고,청산리 전투에서 큰 활약을 하였습니다.",
                        "'독립운동가 신채호'는 안창호 선생이 주도하여 만든 신민회에 가입하여 신민회 취지문을 작성하고, 국채 보상운동에도 적극적으로 참여하며 독립운동에 힘썼습니다.",
                        "산남의진에서 활약하다 순국한 김일원 영웅, 1907년 10월 포항 흥해에서 우편취급소 소장 처단, 경무분파소 소각, 11월 영천, 군위, 포항 등지에서 활동했습니다.",
                        "만주에서 독립운동을 지원한 김우락 영웅, 남편 및 가족과 함께 만주망명 후 해도교거사와 간운사 등 내방가사 지었고 이후 독립운동 지원했습니다.",
                        "신돌석의 진에서 활약한 김용욱 영웅, 1906년 신돌석이 결성한 영릉의진 중군장으로 활동, 삼척 장호관에서 일본인 집 40호를 불태웟고 여러지역에서 항일투쟁 전개했습니다.",
                        "민족 독립을 외치고 청원한 부부 이중업 영웅, 1919년 31운동에 참여했다가 고문으로 두눈을 잃으셨고, 1029년 세상을 떠나셨습니다.",
                        "한국광복군에서 활약한 박영진 영웅,1939년 한국광복군 한국청년간부훈련반에 입교 후 인면전구공작대 대원으로 파견되어 활동하다 연합군과 함께 미얀마 중북부 지역에서 활약했습니다.",
                        "1919년 영덕에서 3ㆍ18독립만세를 이끈 남계병 영웅, 서울 만세운동을 목격한 뒤 귀향하여 영해 독립 만세를 준비하고, 계획을 세우셨습니다.",
                        "독립운동가 이상룡 영웅, 1905년 경남 합천에서 의병부대를 양성하고, 4년 뒤 계몽운동 단체 협회 안동지회를 설립하셨습니다.",
                        "하얼빈을 울린 의사 류기동 영웅, 1920년 만주망명, 흥업단에서 활동 하얼빈 일본총영사관 형사부장 처단하기로 결정햇으나 계획이 들켜 격전끝에 순국하셨습니다.",
                        "매국노 처단을 계획한 27결사대원 손창준 영웅, 1919년 만주에서 이탁이 주도한 27결사대에 가입하여 을사5적과 정미7적 처단을 계획했습니다.",
                        "산남의 진에서 활양하다가 순국하신 김수곡 영웅, 산남의진에 참여하여 일본인 우편취급소 소장을 처단하셨습니다.",
                        "학생항일운동을 이끈 이주호 영웅, 1941년 대구사범학교 재학 중 다혁당 조직, 각 분야에 걸쳐 실력을 양성하고 조국독립 촉진을 목적, 간행물 반딧물이 발각되어 붙잡혀 옥중에서 순국하셨습니다."
                        ]

enum Holiday: String {
    case samiljeol = "0301" // 31절
    case hyukmeong419 = "0419" // 419혁명
    case minju518 = "0518" // 518민주항쟁
    case hyunchoongil = "0606" // 현충일
    case minju610 = "0610" // 610민주화운동
    case koreawar = "0625" // 625
    case jaehunjul = "0717" // 제헌절
    case gwangbokjul = "0815" // 광복절
    case militarynal = "1001" // 국군의날
    case gaechunjul = "1003"  // 개천절
    case hanguelnal = "1009"  // 한글날
    case sunkook = "1117"    // 순국선열의날

    var boardContent: String {
        switch self {
        case .samiljeol:
            return "오늘은 '삼일절'입니다. \n일제강점기였던 1919년 3월 1일 토요일에 일본제국주의에 항거해 한국의 독립을 선언한 독립선언일입니다."
        case .hyukmeong419:
            return "'4·19혁명'을 기억합시다. \n대한민국에서 이승만 정권의 독재에 항거해 시민들이 들고 일어나서 대한민국 제1공화국을 끝낸 민주주의 시민 혁명이다."
        case .minju518:
            return "오늘은 '5·18민주화운동'이 일어난 날입니다. \n1980년 5월 18일부터 5월 27일까지 전라도민이 중심이 되어,민주화를 위해 싸운 날입니다."
        case .hyunchoongil:
            return "오늘은 '현충일'입니다. \n나라를 위해 희생한 순국선열과 전몰한 장병들의 충렬을 기리고 얼을 위로 하는 날입니다."
        case .minju610:
            return "'6·10 민주항쟁'. \n전두환 정권에 맞서 전국에서 일어난 일련의 민주화 운동입니다."
        case .koreawar:
            return "오늘은 '6·25'전쟁이 일어난 날 입니다. \n1950년 6월 25일 오전 4시에 조선민주주의인민공화국이 기습적으로 대한민국을 침공(남침)하여 발발한 전쟁입니다."
        case .jaehunjul:
            return "오늘은 '제헌절'입니다. \n대한민국 헌법(제헌 헌법)이 제정, 공포된 것을 기념하는 날입니다."
        case .gwangbokjul:
            return "오늘은 '광복절'입니다. \n한반도가 일본 제국으로부터 해방된 것을 기념하는 날입니다. 대한민국 만세!"
        case .militarynal:
            return "오늘은 '국군의 날'입니다. \n대한민국 국군의 발전을 기념하는 날입니다."
        case .gaechunjul:
            return "오늘은 '개천절'입니다. \n 한국 역사에서 첫 국가인 고조선을 기념하는 날입니다."
        case .hanguelnal:
            return "오늘은 '한글날'입니다. \n훈민정음의 반포를 기념하는 날입니다."
        case .sunkook:
            return "오늘은 '순국 선열의 날'입니다. \n국권회복을 위해 헌신하신 순국선열의 독립정신과 희생정신을 기리는 날입니다."
        }
    }
}
